compressible/resonators/axisymmetric/sonicFoam/hudson/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//    default         backward;
//	default 		Euler;
	default			CrankNicolson 0.9;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
/*
    default         none;
    div(phi,U)      Gauss upwind;
    div(phid,p)     Gauss limitedLinear 1;
    div(phi,e)      Gauss limitedLinear 1;
    div(phi,K)      Gauss limitedLinear 1;
    div(phiv,p)     Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
*/
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phid,p)     Gauss linearUpwind default;
    div(phi,e)      Gauss linearUpwind default;
    div(phi,K)      Gauss linearUpwind default;
    div(phiv,p)     Gauss linearUpwind default;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
//    default         Gauss linear corrected;
	default 		Gauss linear orthogonal
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{	
//	default         corrected;
    default         orthogonal;
}


// ************************************************************************* //
